{
  "basics": {
    "name": "Hunter Davis",
    "label": "Programmer, Author, Entrepeneur, Composer",
    "picture": "http://www.hunterdavis.com/wp-content/uploads/2007/12/hunterdavisqr.png",
    "email": "hunter@hunterdavis.com",
    "phone": "available upon request",
    "website": "www.hunterdavis.com",
    "summary": " I write books, release software, hack on hardware, ponder ideas and generally have a good time.",
    "location": {
      "address": "13324 3rd ave NE",
      "postalCode": "98125",
      "city": "Seattle",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "huntergdavis",
        "url": "twitter.com/huntergdavis"
      },
      {
        "network": "Personal Blog",
        "username": "Hunter Davis",
        "url": "www.hunterdavis.com"
      },
      {
        "network": "GitHub",
        "username": "Huntergdavis",
        "url": "https://github.com/huntergdavis"
      }
    ]
  },
  "work": [
    {
      "company": "Rhapsody International",
      "position": "Senior Android Engineer",
      "website": "www.rhapsody.com",
      "startDate": "2012-5-22",
      "endDate": "Currently Employed",
      "summary": "Rhapsody is a music streaming service company.  I serve as one of the senior android engineers.  I mentor junior employees and Implement our fundamental architecture. Recent highlights include encryption algorithms, threading and inter-process messaging architecture. waveform equalization.",
      "highlights": [
        "Designed and built encryption and security architecture.",
        "Three patent applications currently in review.",
        "Teach a fundamentals of Computer Science with a focus on Android course weekly.",
        " Designed and built and implemented 3rd party Rhapsody implementations with Audi, Ford, Fan.tv, and more",
        "Mentor junior employees and provide assistance with career advancement.",
        "Created the company mentoring program.",
        "Java"
      ]
    },
    {
      "company": "Miso Media",
      "position": "Android Team Lead, Web Team Member",
      "website": "http://misomedia.com/ (formerly)",
      "startDate": "8-2011",
      "endDate": "3-2012",
      "summary": "Lead developer and architect for all Android Products at Miso Media, a music start-up funded by Google Ventures and 500 Startups.",
      "highlights": [
        "Ported Miso Media's proprietary Tuner from objective-C to Java.",
        "Ported, optimized, and re-factored proprietary Fourier transforms, openGL code, and patent-pending pitch-detection algorithms.",
        "Led iOS and Android hackathon teams at TechCrunch Disrupt SF 2011",
        "Ported Fourier transforms and pitch detection algorithms to JavaScript.",
        "C/C++?Java/JavaScript/HTML5/OpenGL"
      ]
    },
    {
      "company": "Discursive Labs, LLC",
      "position": "CEO",
      "website": "www.discursivelabs.com (former)",
      "startDate": "6-2010",
      "endDate": "8-2011",
      "summary": "CEO and programmer for bootstrapped startup.  ",
      "highlights": [
        "Source Tree Visualizer Project",
        "QuickGrapher Project",
        "C/C++/HTML 5"
      ]
    },
    {
      "company": "Scalable Network Technologies",
      "position": "Senior Software Engineer II",
      "website": "www.scalable-networks.com",
      "startDate": "7-2007",
      "endDate": "7-2010",
      "summary": "Worked with and lead highly technical groups within all teams in company.",
      "highlights": [
        "  Lead military integration events and demos at DoD centers",
        "  Increased visibility to high profile military leaders.",
        "Reverse engineered protocols and implemented new interfaces to military and commodity hardware.",
        "Interviewed candidates and advised CEO on hiring technical leads.",
        "Kernel level developer. ",
        "Team Lead",
        "C/C++"
      ]
    },
    {
      "company": "IU Bloomington",
      "position": "Research Assistant, Associate Instructor",
      "website": "www.indiana.edu",
      "startDate": "8-1-2005",
      "endDate": "7-1-2007",
      "summary": "Research assistant in scientific computing lab.  Associate Instructor",
      "highlights": []
    },
    {
      "company": "Thermwood Corporation",
      "position": "Developer",
      "website": "www.thermwood.com",
      "startDate": "5-1-2003",
      "endDate": "5-1-2005",
      "summary": " Developer for eCabinet Systems, a 3d cad system for cabinet makers.",
      "highlights": [
        "C/C++/OpenGL"
      ]
    },
    {
      "company": "ARS-Group",
      "position": "Programmer",
      "website": "www.ars-group.com",
      "startDate": "2-1-2001",
      "endDate": "4-1-2002",
      "summary": "Web programmer and general purpose programmer.",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Indiana University",
      "area": "Computer Science",
      "studyType": "Masters, focus in Scientific Computing and Artificial Intelligence",
      "startDate": "2005-08-01",
      "endDate": "2007-05-01",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "University Of Evansville",
      "area": "Computer Science",
      "studyType": "Awarded \"Most Outstanding Project in Computer Science\" for senior project.",
      "startDate": "1999-07-01",
      "endDate": "2003-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "Hacks...",
      "publisher": "Amazon",
      "releaseDate": "2011-03-14",
      "website": "http://www.hunterdavis.com/books/ebook-hacks-from-hunter-davis/",
      "summary": "Hacks is a collection of my most popular tutorials, scripts, tweaks, Zipit Z2 work, and source code. Within these forty some chapters reside some of my most interesting work, and certainly some of the most viewed tutorials and hacks on the Internet today. Featured on Hackaday, Engadget, Make online, and hundreds of other blogs and forums, these hacks are meant to enlighten and entertain while providing the reader with concrete examples and launching platforms for future work. Whether you are wanting to reorganize your desktop, reboot your modem, port software to a new platform, administer a Linux box, or just entertain yourself on a lazy sunday, you’ll find something of interest in the chapters ahead. It’s a terrific bargain and an excellent reference guide."
    },
    {
      "name": "Live For Free",
      "publisher": "Amazon",
      "releaseDate": "2011-03-08",
      "website": "http://www.hunterdavis.com/books/live-for-free-ebook/",
      "summary": "Live For Free is an ebook I wrote and distributed in part on www.liveforfree.net from 2008 to 2010. In it, I chronicle the trials and tips I accumulated whilst saving for my startup, Discursive Labs. In a series of 27 easy to digest chapters, I detail the methodologies and money saving practices which allowed me to \"live for free\" and save the capital necessary to bootstrap a successful startup. From selling items on-line with eBay and Craigslist, to gauging market fluctuations and historical pricing metrics, these concrete examples can help you save tremendous amounts of money, while still living the cutting edge high tech lifestyle. An enjoyable afternoon read, I present you this eBook in the hopes that it helps you, in a concrete and direct fashion, achieve your dream. It helped me achieve mine."
    },
    {
      "name": " Build Your Own Distributed Compilation Cluster",
      "publisher": "Amazon",
      "releaseDate": "2011-03-09",
      "website": "http://www.hunterdavis.com/books/build-your-own-distributed-compilation-cluster-ebook/",
      "summary": "My second eBook, Build Your Own Distributed Compilation Cluster – A Practical Walkthrough is a collected volume of my article series of the same name. Throughout the 6 in-depth how-to articles, I’ll take you through the process of building a fully working cross-compilation distributed build system. The canonical example is of building a distributed ARM to X86-64 cross-compilation cluster. This system is also generic enough to apply to most any compilation environment, while remaining powerful enough to outperform all but the most advanced compilation systems. With source code examples provided and easy step by step instructions, this 60+ page instructional eBook is a valuable introductory and practical resource for those interested in distributed compilation, cross compilation, low power computing clusters, and so much more. It’s also one terrific bargain, and an excellent reference. "
    },
    {
      "name": "The Common Instrument Middleware Architecture",
      "publisher": "Grid Enabled Remote Instrumentation",
      "releaseDate": "",
      "website": "ISBN 9 7 8 - 0 - 3 8 7 - 0 9 6 6 2 - 9",
      "summary": "Overview publication on research and implementation of scientific computing middleware"
    }
  ],
  "skills": [
    {
      "name": "Android Development",
      "level": "Professional",
      "keywords": [
        "I've published (personally, as Hunter Davis) over 80 applications to the Google Play store.",
        "250,000+ downloads",
        "50,000 active users year over year",
        "Java/C++/etc"
      ]
    },
    {
      "name": "Hacking",
      "level": "Person of Interest",
      "keywords": [
        "Engadget called one of my works \"a masterpiece\"",
        "Popular Hacks: Zipit, Dockstar, im-me",
        "Reverse Engineering",
        "im-me",
        "65 apps in 60 days",
        "Featured on the front page of Engadget, Hackaday, boingBoing, Make, Wired, and numerous others.",
        "Featured in print in WebDeveloper UK, Webdeveloper IT, and Netrunner Japan maagazine"
      ]
    },
    {
      "name": "Open Source Advocate",
      "level": "Lover of Open Source",
      "keywords": [
        "90+ complete apps on GIthub ",
        "70+ full Android applications open sourced",
        "Featured author on opensource.com",
        "www.hunterdavis.com -> personal hacking and software blog since 2000."
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": [
        "guitar building",
        "composing"
      ]
    }
  ],
  "references": [
    {
      "name": "Tarun Bhatia",
      "reference": "Hunter is a team player who constantly raises the bar. He is always there to answer your questions or offer suggestions with a smile regardless of how busy he might be. His efforts in delivering a great product are equally appreciated. In a hyper competitive environment, he brings the entrepreneurial skills most companies like to see in their employees. He will be a great asset to any team."
    },
    {
      "name": "Joy Liu",
      "reference": "Hunter is the by far the most well-rounded programmer I have ever worked with. He is extremely knowledgeable on Android and web platforms; if you ask him a question, he always has an solution to it. I cannot complement enough about his time management skills; in this case, his hour-by-hour project plan helped our team to pull through a dual-platform AR hack in 18 hours. As a designer, it is a great pleasure to work with Hunter and see your concepts come alive in a good solid working build. I have no doubt in his skills and ability to build impressive softwares and leading his team under tight deadlines."
    },
    {
      "name": "Moiz Alam",
      "reference": "Hunter is an excellent computer scientist who is an expert in a wide variety of areas, including HPC, system architecture, and algorithmic development. Furthermore, he is a great mentor to me at my current company, and is actively involved in idea creation and improving the company's bottom line. He is passionate in all of his endeavors, as evidenced by his website, and his work has been showcased on websites such as hack-a-day and endgadget. I recommend him for any high-power computer science work in general."
    }
  ]
}
